In [1]:
import pandas as pd

In [2]:
s = pd.Series(['banana', 42])   #creating a series. Case Sensitive
print(s)

#The result is a Series named s.

0    banana
1        42
dtype: object

In [3]:
type(s)

pandas.core.series.Series

In [4]:
s[0]    #s is the variable we create, [] means to take something out

'banana'

In [5]:
customers = pd.DataFrame({
    'name':['Rosaline Franklin', 'William Gosset'],
    'occupation':['Chemist', 'Engineer'],
    'dateregister':['2015-02-08', '2021-03-25'],
    'year':[7, 1]},
    index=['c001', 'c002'],
    columns=['name', 'occupation', 'dateregister', 'year']
    
)
customers

#For your reference, the following is the format for creating a DataFrame. (to know how DataFrame is structured) 
#  four columns here

                   name occupation dateregister  year
c001  Rosaline Franklin    Chemist   2015-02-08     7
c002     William Gosset   Engineer   2021-03-25     1

In [6]:
customers = pd.DataFrame({
    'name':['Rosaline Franklin', 'William Gosset', 'Riyan Rattan'],
    'occupation':['Chemist', 'Engineer', 'Student'],
    'dateregister':['2015-02-08', '2021-03-25', '2020-01-15'],
    'year':[7, 1, 4]},
    index=['c001', 'c002', 'c003'],
    columns=['name', 'occupation', 'dateregister', 'year']
    
)
customers

#  We just added a row here with my name

                   name occupation dateregister  year
c001  Rosaline Franklin    Chemist   2015-02-08     7
c002     William Gosset   Engineer   2021-03-25     1
c003       Riyan Rattan    Student   2020-01-15     4

In [7]:
type(customers)

pandas.core.frame.DataFrame

In [8]:
customers.dtypes

name            object
occupation      object
dateregister    object
year             int64
dtype: object

In [9]:
customers['name']

#  takes out name column

c001    Rosaline Franklin
c002       William Gosset
c003         Riyan Rattan
Name: name, dtype: object

In [10]:
year_column = customers['year']

In [11]:
type(year_column)

pandas.core.series.Series

In [12]:
third_row = customers.iloc[2]      #take the third row (2 cause start at zero! 0 is Row 1, 1 is Row 2, 2 is row 3)
third_row

            #use iloc to fetch by row index number; use iloc to get the third row (the row with your name) from customers

name            Riyan Rattan
occupation           Student
dateregister      2020-01-15
year                       4
Name: c003, dtype: object

In [13]:
c003_row = customers.loc['c003']     #does not work if no put 'c003'
c003_row                              #c003 is the same way as third_row but another way

#Write codes to use loc to get the third row (the row with your name) from customers and show the result

name            Riyan Rattan
occupation           Student
dateregister      2020-01-15
year                       4
Name: c003, dtype: object

In [14]:
type(customers)   #naming the type customers is, which is DataFrame

pandas.core.frame.DataFrame

In [15]:
type(year_column)     #columns is a series

pandas.core.series.Series

In [16]:
type(third_row)     #row is a series

pandas.core.series.Series

In [17]:
multi_columns = customers [['name', 'year']]
multi_columns

                   name  year
c001  Rosaline Franklin     7
c002     William Gosset     1
c003       Riyan Rattan     4

In [18]:
type(multi_columns)   #more than one columns = data frame

pandas.core.frame.DataFrame

In [19]:
name_column=customers['name']
name_column

c001    Rosaline Franklin
c002       William Gosset
c003         Riyan Rattan
Name: name, dtype: object

In [37]:
type[name_column]    #single brackets output different

type[                   name
c001  Rosaline Franklin
c002     William Gosset
c003       Riyan Rattan]

In [21]:
name_column=customers[['name']]
name_column

                   name
c001  Rosaline Franklin
c002     William Gosset
c003       Riyan Rattan

In [39]:
type(name_column)    #named it with ( )

pandas.core.frame.DataFrame

In [23]:
year_column

c001    7
c002    1
c003    4
Name: year, dtype: int64

In [24]:
year_column.mean()     #12 What is the mean of year?

4.0

In [25]:
year_column.describe()  #13 What is the basic descriptive stats of year?

#Use describe().

count    3.0
mean     4.0
std      3.0
min      1.0
25%      2.5
50%      4.0
75%      5.5
max      7.0
Name: year, dtype: float64

In [26]:
type(year_column.describe())   #adding type(   )  tells if series or data frame

pandas.core.series.Series

In [27]:
year_column=customers['year']          #fetch the year column
year_column

#use [] to get the year column from customers and show the result
#[] means to take something out

c001    7
c002    1
c003    4
Name: year, dtype: int64

In [28]:
customers

                   name occupation dateregister  year
c001  Rosaline Franklin    Chemist   2015-02-08     7
c002     William Gosset   Engineer   2021-03-25     1
c003       Riyan Rattan    Student   2020-01-15     4

In [29]:
customers.loc['c003', ['name', 'occupation']]

name          Riyan Rattan
occupation         Student
Name: c003, dtype: object

In [30]:
customers.loc['c003', ['name', ]]     #notice the difference

name    Riyan Rattan
Name: c003, dtype: object

In [31]:
customers.loc[customers['year'] >2, :]    
                        
                        #    customer.loc will show you the row
                        #    within brackets can show the rows I want to show: the years greater than 2 ---the condition
            #Boolean Subsetting: Series
            #Write the following codes, which fetch rows with year greater than 2. Show the result of all columns.

                   name occupation dateregister  year
c001  Rosaline Franklin    Chemist   2015-02-08     7
c003       Riyan Rattan    Student   2020-01-15     4

In [32]:
customers['year']>2

c001     True
c002    False
c003     True
Name: year, dtype: bool

In [33]:
customers.loc[customers['occupation']=='Student', :]     #fetch rows with student as the occupation

#Write the following codes, which fetch rows with student as the occupation. Show the result of all columns.

#Boolean Subsetting: Series

              name occupation dateregister  year
c003  Riyan Rattan    Student   2020-01-15     4

In [34]:
customers.to_csv('scientists_df.tsv', sep='\t')    #saved as scientists_df.tsv

#customer data fram save to csv, this is file name, and should tab separated file
#tab separated file: tsv  or  csv (comma separated file)
#To save your customers DataFrame as a TSV file, simply use to_csv() as above
#To receive the credits, upload Excercise Word document AND your scientists_df.tsv from Jupitar as your answer.